"""
Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб.
"""

Numbers_dict = {}
for i in range(1,10):
    keys[i]=i**3
print(keys)
